In [215]:
import seaborn as sns
df = sns.load_dataset("tips")
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [216]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [217]:
df.shape

(244, 7)

In [218]:
df.duplicated().sum()

1

In [221]:
df.drop_duplicates(inplace = True)

In [222]:
df.shape

(243, 7)

In [223]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [224]:
df.describe()

       total_bill         tip        size
count  243.000000  243.000000  243.000000
mean    19.813868    3.002387    2.572016
std      8.910071    1.385002    0.952356
min      3.070000    1.000000    1.000000
25%     13.380000    2.000000    2.000000
50%     17.810000    2.920000    2.000000
75%     24.175000    3.575000    3.000000
max     50.810000   10.000000    6.000000

In [225]:
df.head(2)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [226]:
# Encoading  -- labelencoder
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [227]:
df.smoker = le.fit_transform(df.smoker)
df.head(2)

   total_bill   tip     sex  smoker  day    time  size
0       16.99  1.01  Female       0  Sun  Dinner     2
1       10.34  1.66    Male       0  Sun  Dinner     3

In [228]:
df.day = le.fit_transform(df.day)
df.head(2)

   total_bill   tip     sex  smoker  day    time  size
0       16.99  1.01  Female       0    2  Dinner     2
1       10.34  1.66    Male       0    2  Dinner     3

In [229]:
df.time = le.fit_transform(df.time)
df.head(2)

   total_bill   tip     sex  smoker  day  time  size
0       16.99  1.01  Female       0    2     0     2
1       10.34  1.66    Male       0    2     0     3

In [230]:
df.head()

   total_bill   tip     sex  smoker  day  time  size
0       16.99  1.01  Female       0    2     0     2
1       10.34  1.66    Male       0    2     0     3
2       21.01  3.50    Male       0    2     0     3
3       23.68  3.31    Male       0    2     0     2
4       24.59  3.61  Female       0    2     0     4

In [231]:
from sklearn.preprocessing import OneHotEncoder
df1 = pd.get_dummies(df.sex)
df1.head()

   Male  Female
0     0       1
1     1       0
2     1       0
3     1       0
4     0       1

In [232]:
df2 = pd.get_dummies(df)

In [233]:
df2.head()

   total_bill   tip  smoker  day  time  size  sex_Male  sex_Female
0       16.99  1.01       0    2     0     2         0           1
1       10.34  1.66       0    2     0     3         1           0
2       21.01  3.50       0    2     0     3         1           0
3       23.68  3.31       0    2     0     2         1           0
4       24.59  3.61       0    2     0     4         0           1

In [234]:
df2.shape

(243, 8)

In [236]:
X = df2.drop('tip', axis = 1)
y = df2['tip']

In [242]:
X.head(2)

   total_bill  smoker  day  time  size  sex_Male  sex_Female
0       16.99       0    2     0     2         0           1
1       10.34       0    2     0     3         1           0

In [238]:
y.shape

(243,)

In [239]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [240]:
model.fit(X,y)

LinearRegression()

In [245]:
predict = model.predict([[16.99, 0, 2, 0, 2 , 0, 1]])

In [246]:
predict

array([2.68216172])

In [247]:
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix
from sklearn.metrics import classification_report

In [248]:
confusion_matrix(X,y)

ValueError: Classification metrics can't handle a mix of continuous-multioutput and continuous targets